vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NSING.N32L40x_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.7.37" 
    xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="https://raw.githubusercontent.com/Open-CMSIS-Pack/Open-CMSIS-Pack-Spec/v1.7.37/schema/PACK.xsd">
    <vendor>NSING</vendor>
    <url>https://www.nsing.com.sg/public/uploads/armpacks/</url>
    <name>N32L40x_DFP</name>
    <description>Nsing N32L40x Series Device Support, Drivers and Examples</description>

    <releases>
		<release date="2024-08-14" version="1.0.2">		    
            First release of N32L40x_DFP
        </release>
    </releases>

    <keywords>
        <keyword>NSING</keyword>
        <keyword>Device Support</keyword>
        <keyword>N32L40x</keyword>
		<keyword>N32</keyword>
    </keywords>

    <devices>
        <family Dfamily="N32L40x Series" Dvendor="NSING:185">
          <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dendian="Little-endian"/>
          <subFamily DsubFamily="N32L401">	  
		   <processor Dclock="64000000"/>	
           <description>
Up to 64MHz ARM Cortex-M4F, 128KB Flash, 16KB SRAM, 38xGPIO(MAX), 9xTimer, RTC, 14xPWM(MAX), 1x12bit 5Msps ADC, 1x12bit DAC, 2xOPAMP, 2xCOMP, 4xU(S)ART, 1xLPUART, 2xSPI/I2S, 2xI2C, USB 2.0 FS Device, 1xCAN 2.0B, 1xDMA, Hardware Cryptographic Engine.
           </description>			   
           <compile header="firmware/CMSIS/device/n32l40x.h" define="N32L40x USE_STDPERIPH_DRIVER"/>  
	  	   <feature type="VCC"      n="1.80"        m="5.50"/>		
		   <feature type="Temp"     n="-40"        m="105"/>	
		   <feature type="RTC"      n="1"/>		   
		  <!-- *************************  Device 'N32L401C8'  ***************************** -->
		  <device Dname="N32L401C8"> 
			<description>
- Package:LQFP48
- OPAMP: 2x 
- COMP: 2x 
- LPUART: 1x		
- AES/T-DES/SHA/SM1/SM3/SM4/SM7	
			</description>				
		    <feature type="Memory"   n="64" 	name="64KB Flash"/>	
		    <feature type="Memory"   n="16" 	name="16KB SRAM"/>	
			<feature type="IOs"      n="38"     name="Input and Output Ports"/>
			<feature type="Timer"    n="9"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="1"/>	
			<feature type="DAC"      n="1"/>	
			<feature type="USART"    n="3"/>
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>
			<feature type="USBD"     n="1"/>				
			<feature type="DMA"      n="1"/>			
			
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
			<algorithm name="Flash/N32L40x.FLM" start="0x08000000" size="0x10000" default="1"/>
			<debug svd="svd/N32L401.svd"/>
          </device>	
		 <!-- *************************  Device 'N32L401CB'  ***************************** -->
		  <device Dname="N32L401CB"> 
			<description>
- Package:LQFP48
- OPAMP: 2x 
- COMP: 2x 
- LPUART: 1x		
- AES/T-DES/SHA/SM1/SM3/SM4/SM7	
			</description>				
		    <feature type="Memory"   n="128" 	name="128KB Flash"/>	
		    <feature type="Memory"   n="16" 	name="16KB SRAM"/>	
			<feature type="IOs"      n="38"     name="Input and Output Ports"/>
			<feature type="Timer"    n="9"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="1"/>	
			<feature type="DAC"      n="1"/>	
			<feature type="USART"    n="3"/>
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>
			<feature type="USBD"     n="1"/>				
			<feature type="DMA"      n="1"/>			
			
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x20000" default="1" startup="1"/>
			<algorithm name="Flash/N32L40x.FLM" start="0x08000000" size="0x20000" default="1"/>
			<debug svd="svd/N32L401.svd"/>
          </device>	
		  
		  </subFamily>
          
		  <subFamily DsubFamily="N32L402">
                <processor Dclock="64000000"/>
                <description>
Up to 64MHz ARM Cortex-M4F, 128KB Flash, 16KB SRAM, 52xGPIO(MAX), 9xTimer, RTC, 14xPWM(MAX), 1x12bit 5Msps ADC, 1x12bit DAC, 2xOPAMP, 2xCOMP, 4xU(S)ART, 1xLPUART, 2xSPI/I2S, 2xI2C, USB 2.0 FS Device, 1xDMA, Hardware Cryptographic Engine.
                </description>			
                <compile header="firmware/CMSIS/device/n32l40x.h" define="N32L40X N32L402 USE_STDPERIPH_DRIVER"/>
		 <!-- *************************  Device 'N32L402C8'  ***************************** -->
			<device Dname="N32L402C8"> 
			<description>
- OPAMP: 2x 
- COMP: 2x 
- LPUART: 1x		
- AES/T-DES/SHA/SM1/SM3/SM4/SM7	
			</description>				
		    <feature type="Memory"   n="64" 	name="64KB Flash"/>	
		    <feature type="Memory"   n="16" 	name="16KB SRAM"/>	
			<feature type="IOs"      n="38"     name="Input and Output Ports"/>
			<feature type="Timer"    n="9"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="1"/>	
			<feature type="DAC"      n="1"/>	
			<feature type="USART"    n="3"/>
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>
			<feature type="USBD"     n="1"/>				
			<feature type="DMA"      n="1"/>			
			
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
			<algorithm name="Flash/N32L40x.FLM" start="0x08000000" size="0x10000" default="1"/>
			<debug svd="svd/N32L402.svd"/>
          </device>	
		 <!-- *************************  Device 'N32L402CB'  ***************************** -->
			<device Dname="N32L402CB"> 
			<description>
- OPAMP: 2x 
- COMP: 2x 
- LPUART: 1x		
- AES/T-DES/SHA/SM1/SM3/SM4/SM7	
			</description>				
		    <feature type="Memory"   n="128" 	name="128KB Flash"/>	
		    <feature type="Memory"   n="16" 	name="16KB SRAM"/>	
			<feature type="IOs"      n="38"     name="Input and Output Ports"/>
			<feature type="Timer"    n="9"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="1"/>	
			<feature type="DAC"      n="1"/>	
			<feature type="USART"    n="3"/>
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>
			<feature type="USBD"     n="1"/>				
			<feature type="DMA"      n="1"/>			
			
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x20000" default="1" startup="1"/>
			<algorithm name="Flash/N32L40x.FLM" start="0x08000000" size="0x20000" default="1"/>
			<debug svd="svd/N32L402.svd"/>
          </device>	
		 <!-- *************************  Device 'N32L402R8'  ***************************** -->
			<device Dname="N32L402R8"> 
			<description>
- OPAMP: 2x 
- COMP: 2x 
- LPUART: 1x		
- AES/T-DES/SHA/SM1/SM3/SM4/SM7	
			</description>				
		    <feature type="Memory"   n="64" 	name="64KB Flash"/>	
		    <feature type="Memory"   n="16" 	name="16KB SRAM"/>	
			<feature type="IOs"      n="52"     name="Input and Output Ports"/>
			<feature type="Timer"    n="9"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="1"/>	
			<feature type="DAC"      n="1"/>	
			<feature type="USART"    n="3"/>
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>
			<feature type="USBD"     n="1"/>				
			<feature type="DMA"      n="1"/>			
			
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
			<algorithm name="Flash/N32L40x.FLM" start="0x08000000" size="0x10000" default="1"/>
			<debug svd="svd/N32L402.svd"/>
          </device>	
