vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NSING.N32L40x_DFP.pdsc
		 <!-- *************************  Device 'N32L402RB'  ***************************** -->
			<device Dname="N32L402RB"> 
			<description>
- OPAMP: 2x 
- COMP: 2x 
- LPUART: 1x		
- AES/T-DES/SHA/SM1/SM3/SM4/SM7	
			</description>				
		    <feature type="Memory"   n="128" 	name="128KB Flash"/>	
		    <feature type="Memory"   n="16" 	name="16KB SRAM"/>	
			<feature type="IOs"      n="52"     name="Input and Output Ports"/>
			<feature type="Timer"    n="9"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="1"/>	
			<feature type="DAC"      n="1"/>	
			<feature type="USART"    n="3"/>
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>
			<feature type="USBD"     n="1"/>				
			<feature type="DMA"      n="1"/>			
			
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x20000" default="1" startup="1"/>
			<algorithm name="Flash/N32L40x.FLM" start="0x08000000" size="0x20000" default="1"/>
			<debug svd="svd/N32L402.svd"/>
          </device>		

		  </subFamily>
          
		  <subFamily DsubFamily="N32L403">
                <processor Dclock="64000000"/>
                <description>
Up to 64MHz ARM Cortex-M4F, 128KB Flash, 24KB SRAM, 26xGPIO(MAX), 9xTimer, RTC, 14xPWM(MAX), 1x12bit 5Msps ADC, 1x12bit DAC, 2xOPAMP, 2xCOMP, 4xU(S)ART, 1xLPUART, 2xSPI/I2S, 2xI2C, USB 2.0 FS Device, 1xCAN 2.0B, 1xDMA, Hardware Cryptographic Engine.
                </description>		
                <compile header="firmware/CMSIS/device/n32l40x.h" define="N32L40X N32L403 USE_STDPERIPH_DRIVER"/>		  
		 <!-- *************************  Device 'N32L403K8'  ***************************** -->
			<device Dname="N32L403K8"> 
			<description>
- OPAMP: 2x 
- COMP: 2x 
- LPUART: 1x		
- AES/T-DES/SHA/SM1/SM3/SM4/SM7	
			</description>				
		    <feature type="Memory"   n="64" 	name="64KB Flash"/>	
		    <feature type="Memory"   n="16" 	name="16KB SRAM"/>	
			<feature type="IOs"      n="26"     name="Input and Output Ports"/>
			<feature type="Timer"    n="9"/>
			<feature type="PWM"      n="14"/>				
			<feature type="ADC"      n="1"/>	
			<feature type="DAC"      n="1"/>	
			<feature type="USART"    n="3"/>
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>
			<feature type="USBD"     n="1"/>				
			<feature type="DMA"      n="1"/>			
			
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
			<algorithm name="Flash/N32L40x.FLM" start="0x08000000" size="0x10000" default="1"/>
			<debug svd="svd/N32L402.svd"/>
          </device>				
		 <!-- *************************  Device 'N32L403KB'  ***************************** -->
			<device Dname="N32L403KB"> 
			<description>
- Package:LQFP48
- OPAMP: 2x 
- COMP: 2x 
- LPUART: 1x		
- AES/T-DES/SHA/SM1/SM3/SM4/SM7	
			</description>				
		    <feature type="Memory"   n="128" 	name="128KB Flash"/>	
		    <feature type="Memory"   n="24" 	name="24KB SRAM"/>	
			<feature type="IOs"      n="26"     name="Input and Output Ports"/>
			<feature type="Timer"    n="9"/>
			<feature type="PWM"      n="14"/>				
			<feature type="ADC"      n="1"/>	
			<feature type="DAC"      n="1"/>	
			<feature type="USART"    n="3"/>
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>
			<feature type="USBD"     n="1"/>				
			<feature type="DMA"      n="1"/>			
			
			<memory id="IRAM1"   start="0x20000000" size="0x6000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x20000" default="1" startup="1"/>
			<algorithm name="Flash/N32L40x.FLM" start="0x08000000" size="0x20000" default="1"/>
			<debug svd="svd/N32L402.svd"/>
          </device>		
		  
		  </subFamily>
          
		  <subFamily DsubFamily="N32L406">
                <processor Dclock="64000000"/>
                <description>
Up to 64MHz ARM Cortex-M4F, 128KB Flash, 24KB SRAM, 64xGPIO(MAX), 9xTimer, RTC, 28xPWM(MAX), 1x12bit 5Msps ADC, 1x12bit DAC, 2xOPAMP, 2xCOMP, 5xU(S)ART, 1xLPUART, 2xSPI/I2S, 2xI2C, USB 2.0 FS Device, 1xCAN 2.0B, 1xDMA, LCD, Hardware Cryptographic Engine.
                </description>	
                <compile header="firmware/CMSIS/device/n32l40x.h" define="N32L40X N32L406 USE_STDPERIPH_DRIVER"/>			  
		 <!-- *************************  Device 'N32L406C8'  ***************************** -->
			<device Dname="N32L406C8"> 
			<description>
- OPAMP: 2x 
- COMP: 2x 
- LPUART: 1x	
- LCD	
- AES/T-DES/SHA/SM1/SM3/SM4/SM7	
			</description>				
		    <feature type="Memory"   n="64" 	name="64KB Flash"/>	
		    <feature type="Memory"   n="16" 	name="16KB SRAM"/>	
			<feature type="IOs"      n="38"     name="Input and Output Ports"/>
			<feature type="Timer"    n="9"/>
			<feature type="PWM"      n="14"/>				
			<feature type="ADC"      n="1"/>	
			<feature type="DAC"      n="1"/>	
			<feature type="USART"    n="3"/>
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>
			<feature type="USBD"     n="1"/>				
			<feature type="DMA"      n="1"/>			
			
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
			<algorithm name="Flash/N32L40x.FLM" start="0x08000000" size="0x10000" default="1"/>
			<debug svd="svd/N32L406.svd"/>
          </device>				
		 <!-- *************************  Device 'N32L406CB'  ***************************** -->
			<device Dname="N32L406CB"> 
			<description>
- OPAMP: 2x 
- COMP: 2x 
- LPUART: 1x	
- LCD	
- AES/T-DES/SHA/SM1/SM3/SM4/SM7	
			</description>				
		    <feature type="Memory"   n="128" 	name="128KB Flash"/>	
		    <feature type="Memory"   n="24" 	name="24KB SRAM"/>	
			<feature type="IOs"      n="38"     name="Input and Output Ports"/>
			<feature type="Timer"    n="9"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="1"/>	
			<feature type="DAC"      n="1"/>	
			<feature type="USART"    n="3"/>
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>
			<feature type="USBD"     n="1"/>				
			<feature type="DMA"      n="1"/>			
			
			<memory id="IRAM1"   start="0x20000000" size="0x6000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x20000" default="1" startup="1"/>
			<algorithm name="Flash/N32L40x.FLM" start="0x08000000" size="0x20000" default="1"/>
			<debug svd="svd/N32L406.svd"/>
          </device>				
		 <!-- *************************  Device 'N32L406R8'  ***************************** -->
			<device Dname="N32L406R8"> 
			<description>
- OPAMP: 2x 
- COMP: 2x 
- LPUART: 1x	
- LCD	
- LPRCNT: 1x
- AES/T-DES/SHA/SM1/SM3/SM4/SM7	
			</description>				
		    <feature type="Memory"   n="64" 	name="64KB Flash"/>	
		    <feature type="Memory"   n="16" 	name="16KB SRAM"/>	
			<feature type="IOs"      n="52"     name="Input and Output Ports"/>
			<feature type="Timer"    n="9"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="1"/>	
			<feature type="DAC"      n="1"/>	
			<feature type="USART"    n="3"/>
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>
			<feature type="USBD"     n="1"/>				
			<feature type="DMA"      n="1"/>			
			
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
			<algorithm name="Flash/N32L40x.FLM" start="0x08000000" size="0x10000" default="1"/>
			<debug svd="svd/N32L406.svd"/>
          </device>			
		 <!-- *************************  Device 'N32L406RB'  ***************************** -->
			<device Dname="N32L406RB"> 
			<description>
- OPAMP: 2x 
- COMP: 2x 
- LPUART: 1x	
- LCD	
- LPRCNT: 1x
- AES/T-DES/SHA/SM1/SM3/SM4/SM7	
			</description>				
		    <feature type="Memory"   n="64" 	name="64KB Flash"/>	
		    <feature type="Memory"   n="16" 	name="16KB SRAM"/>	
			<feature type="IOs"      n="52"     name="Input and Output Ports"/>
			<feature type="Timer"    n="9"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="1"/>	
			<feature type="DAC"      n="1"/>	
			<feature type="USART"    n="3"/>
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>
			<feature type="USBD"     n="1"/>				
			<feature type="DMA"      n="1"/>			
			
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
			<algorithm name="Flash/N32L40x.FLM" start="0x08000000" size="0x10000" default="1"/>
			<debug svd="svd/N32L406.svd"/>
          </device>				
		 <!-- *************************  Device 'N32L406MB'  ***************************** -->
			<device Dname="N32L406MB"> 
			<description>
- OPAMP: 2x 
- COMP: 2x 
- LPUART: 1x	
- LCD	
- LPRCNT: 1x
- AES/T-DES/SHA/SM1/SM3/SM4/SM7	
			</description>				
		    <feature type="Memory"   n="128" 	name="128KB Flash"/>	
		    <feature type="Memory"   n="24" 	name="24KB SRAM"/>	
			<feature type="IOs"      n="64"     name="Input and Output Ports"/>
			<feature type="Timer"    n="9"/>
			<feature type="PWM"      n="28"/>				
			<feature type="ADC"      n="1"/>	
			<feature type="DAC"      n="1"/>	
			<feature type="USART"    n="3"/>
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>
			<feature type="USBD"     n="1"/>				
			<feature type="DMA"      n="1"/>			
			
			<memory id="IRAM1"   start="0x20000000" size="0x6000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x20000" default="1" startup="1"/>
			<algorithm name="Flash/N32L40x.FLM" start="0x08000000" size="0x20000" default="1"/>
			<debug svd="svd/N32L406.svd"/>
          </device>		 
		  
        </subFamily>
	
        </family>
    </devices> 


    <conditions>   	
		<!-- Device Conditions -->
		<condition id="N32L40x">
		  <description>NSING N32L40x Devices</description> 
		  <require Dvendor="NSING:185" Dname="N32*"/> 
		</condition>
		
		<!-- Device + CMSIS Conditions -->
        <condition id="N32L40x CMSIS">            
		    <description>NSING N32L40x Device and the ARM compiler</description>
		    <require condition="N32L40x"/>
		    <require Tcompiler="ARMCC"/>
        </condition>

