vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NSING.N32L40x_DFP.pdsc
         <component Cclass="Device" Cgroup="N32L40x_StdPeripherals" Csub="DAC" Cversion="1.0.0" condition="N32L40x STDPERIPHERALS RCC">
            <description>Digital-to-analog converter (DAC) driver for N32L40x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DAC
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32l40x_std_periph_driver/inc/n32l40x_dac.h"/>
                <file category="source" name="firmware/n32l40x_std_periph_driver/src/n32l40x_dac.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32L40x_StdPeripherals" Csub="DMA" Cversion="1.0.0" condition="N32L40x STDPERIPHERALS RCC">
            <description>DMA controller (DMA) driver for N32L40x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DMA
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32l40x_std_periph_driver/inc/n32l40x_dma.h"/>
                <file category="source" name="firmware/n32l40x_std_periph_driver/src/n32l40x_dma.c"/>
            </files>
        </component>

<!--         <component Cclass="Device" Cgroup="N32L40x_StdPeripherals" Csub="DVP" Cversion="1.0.0" condition="N32L40x STDPERIPHERALS RCC">
            <description>Digital video port (DVP) driver for N32L40x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DVP
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32l40x_std_periph_driver/inc/n32l40x_dvp.h"/>
                <file category="source" name="firmware/n32l40x_std_periph_driver/src/n32l40x_dvp.c"/>
            </files>
        </component> -->
		
        <component Cclass="Device" Cgroup="N32L40x_StdPeripherals" Csub="EXTI" Cversion="1.0.0" condition="N32L40x STDPERIPHERALS RCC">
            <description>External interrupt/event controller (EXTI) driver for N32L40x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_EXTI
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32l40x_std_periph_driver/inc/n32l40x_exti.h"/>
                <file category="source" name="firmware/n32l40x_std_periph_driver/src/n32l40x_exti.c"/>
            </files>
        </component>
		
<!--         <component Cclass="Device" Cgroup="N32L40x_StdPeripherals" Csub="ETH" Cversion="1.0.0" condition="N32L40x STDPERIPHERALS RCC">
            <description>Ethernet MAC (ETH) driver for N32L40x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_ETH
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32l40x_std_periph_driver/inc/n32l40x_eth.h"/>
                <file category="source" name="firmware/n32l40x_std_periph_driver/src/n32l40x_eth.c"/>
            </files>
        </component> -->
		
        <component Cclass="Device" Cgroup="N32L40x_StdPeripherals" Csub="FLASH" Cversion="1.0.0" condition="N32L40x STDPERIPHERALS RCC">
            <description>Embedded Flash memory (FLASH) driver for N32L40x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_FLASH
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32l40x_std_periph_driver/inc/n32l40x_flash.h"/>
                <file category="source" name="firmware/n32l40x_std_periph_driver/src/n32l40x_flash.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32L40x_StdPeripherals" Csub="GPIO" Cversion="1.0.0" condition="N32L40x STDPERIPHERALS RCC">
            <description>General-purpose I/O (GPIO) driver for N32L40x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_GPIO
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32l40x_std_periph_driver/inc/n32l40x_gpio.h"/>
                <file category="source" name="firmware/n32l40x_std_periph_driver/src/n32l40x_gpio.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32L40x_StdPeripherals" Csub="I2C" Cversion="1.0.0" condition="N32L40x STDPERIPHERALS RCC">
            <description>Inter-integrated circuit (I2C) interface driver for N32L40x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_I2C
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32l40x_std_periph_driver/inc/n32l40x_i2c.h"/>
                <file category="source" name="firmware/n32l40x_std_periph_driver/src/n32l40x_i2c.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32L40x_StdPeripherals" Csub="IWDG" Cversion="1.0.0" condition="N32L40x STDPERIPHERALS RCC">
            <description>Independent watchdog (IWDG) driver for N32L40x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_IWDG
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32l40x_std_periph_driver/inc/n32l40x_iwdg.h"/>
                <file category="source" name="firmware/n32l40x_std_periph_driver/src/n32l40x_iwdg.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32L40x_StdPeripherals" Csub="LCD" Cversion="1.0.0" condition="N32L40x STDPERIPHERALS RCC">
            <description>Liquid Crystal Display (LCD) driver for N32L40x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_LCD
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32l40x_std_periph_driver/inc/n32l40x_lcd.h"/>
                <file category="source" name="firmware/n32l40x_std_periph_driver/src/n32l40x_lcd.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32L40x_StdPeripherals" Csub="LPTIM" Cversion="1.0.0" condition="N32L40x STDPERIPHERALS RCC">
            <description>Low Power Timers (LPTIM) driver for N32L40x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_LPTIM
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32l40x_std_periph_driver/inc/n32l40x_lptim.h"/>
                <file category="source" name="firmware/n32l40x_std_periph_driver/src/n32l40x_lptim.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32L40x_StdPeripherals" Csub="LPUART" Cversion="1.0.0" condition="N32L40x STDPERIPHERALS RCC">
            <description>Low Power Universal asynchronous receiver transmitter (LPUART) driver for N32L40x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_LPUART
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32l40x_std_periph_driver/inc/n32l40x_lpuart.h"/>
                <file category="source" name="firmware/n32l40x_std_periph_driver/src/n32l40x_lpuart.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32L40x_StdPeripherals" Csub="OPAMP" Cversion="1.0.0" condition="N32L40x STDPERIPHERALS RCC">
            <description>Operational amplifier (OPAMP) driver for N32L40x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_OPAMP
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32l40x_std_periph_driver/inc/n32l40x_opamp.h"/>
                <file category="source" name="firmware/n32l40x_std_periph_driver/src/n32l40x_opamp.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32L40x_StdPeripherals" Csub="PWR" Cversion="1.0.0" condition="N32L40x STDPERIPHERALS RCC">
            <description>Power controller (PWR) driver for N32L40x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_PWR
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32l40x_std_periph_driver/inc/n32l40x_pwr.h"/>
                <file category="source" name="firmware/n32l40x_std_periph_driver/src/n32l40x_pwr.c"/>
            </files>
        </component>

