vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NSING.N32L40x_DFP.pdsc
        <component Cclass="Device" Cgroup="Algorithm Libs" Csub="AES" Cversion="1.0.0" condition="N32L40x Algorithm Common">
		    <description>AES driver for N32L40x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_ALGO_AES
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32l40x_algo_lib/inc/n32l40x_aes.h"/>
                <file category="source" name="firmware/n32l40x_algo_lib/lib/n32l40x_aes.lib"/>
            </files>
        </component>
 
        <component Cclass="Device" Cgroup="Algorithm Libs" Csub="DES" Cversion="1.0.0" condition="N32L40x Algorithm Common">
		    <description>DES driver for N32L40x</description>		
            <RTE_Components_h>
        #define RTE_DEVICE_ALGO_DES
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32l40x_algo_lib/inc/n32l40x_des.h"/>
                <file category="source" name="firmware/n32l40x_algo_lib/lib/n32l40x_des.lib"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="Algorithm Libs" Csub="RNG" Cversion="1.0.0" condition="N32L40x Algorithm Common">
		    <description>RNG driver for N32L40x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_ALGO_RNG
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32l40x_algo_lib/inc/n32l40x_rng.h"/>
                <file category="source" name="firmware/n32l40x_algo_lib/lib/n32l40x_rng.lib"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="Algorithm Libs" Csub="HASH" Cversion="1.0.0" condition="N32L40x Algorithm Common">
		    <description>HASH driver for N32L40x</description>		
            <RTE_Components_h>
        #define RTE_DEVICE_ALGO_HASH
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32l40x_algo_lib/inc/n32l40x_hash.h"/>
                <file category="source" name="firmware/n32l40x_algo_lib/lib/n32l40x_hash.lib"/>
            </files>
        </component>	
		
    </components>
</package>
